export const agreementText = `VIP 会员服务协议

本协议由您（以下简称“用户”或“您”）与[小程序运营主体公司名称]（以下简称“我们”或“公司”）就临研核心词汇小程序 VIP 会员服务（以下简称“本服务”）的使用所订立。请您仔细阅读以下全部内容。如您使用本服务，即表示您同意接受本协议的所有条款和条件。若您不同意本协议的任何条款，请勿使用本服务。

一、服务内容
1.我们通过临研核心词汇小程序向 VIP 会员提供丰富的临研核心词汇背诵、学习服务，具体服务内容以小程序实际展示及提供为准。
2.我们有权根据实际情况对服务内容进行调整、优化、升级或新增，但会尽力确保 VIP 会员能够获得至少同等价值的服务体验。在对服务内容进行重大变更前，我们将以适当方式提前通知 VIP 会员。

二、会员资格与期限
1. 会员资格获取：用户需按照小程序内提示的付费方式支付相应的会员费用，完成支付流程后，即成为临研核心词汇小程序的 VIP 会员，享有本协议约定的会员服务。
2. 会员期限：VIP 会员服务自购买成功并开通会员权限起生效，有效期以用户购买的会员套餐为准，具体时长在购买页面明确展示。会员有效期届满后，如用户未进行续费，将自动失去 VIP 会员资格，无法继续享受相应服务。

三、费用与支付
1. 费用标准：VIP 会员服务费用根据不同的会员套餐设定，具体价格以小程序内展示的收费标准为准。我们保留根据运营成本、市场情况等因素调整会员费用的权利，但在调整前会提前以合理方式通知现有 VIP 会员。对于会员费用调整生效前已购买会员服务且在有效期内的用户，仍按照购买时的价格执行至会员有效期结束。
2. 支付方式：我们支持多种常见的支付方式，如微信支付、支付宝支付等，具体支付方式以小程序内实际提供的为准。用户应确保支付信息的准确性和完整性，因支付信息错误导致支付失败或其他问题的，由用户自行承担责任。
3. 退款政策：除非法律另有规定或本协议另有约定，会员费用一经支付，不予退还。但在以下特殊情况下，我们将根据实际情况处理退款申请： 因小程序自身故障或技术问题，导致 VIP 会员在会员有效期内无法正常使用服务累计超过[30]天，且经我们确认属实，用户有权要求按照剩余未使用会员期限比例退还相应费用。 若我们主动停止提供 VIP 会员服务，我们将按照剩余未使用会员期限比例向用户退还相应费用。用户可以与我们小程序预留的联系人及联系方式进行沟通。

四、双方权利与义务
（一）用户权利与义务
1. 权利：有权在会员有效期内按照本协议约定使用临研核心词汇小程序的 VIP 会员服务。 有权对我们提供的服务提出意见 and 建议，我们将认真对待并根据实际情况进行改进。
2. 义务：应按照本协议约定支付会员费用，保证所提供的注册信息真实、准确、完整，并及时更新注册信息。若因用户提供的信息不真实、不准确或不完整导致任何问题或损失，由用户自行承担责任。不得利用本服务从事任何违法、违规或侵犯他人合法权益的活动，包括但不限于利用小程序传播淫秽、暴力、恐怖、虚假信息等内容，或擅自将 VIP 会员账号转借他人使用、进行商业牟利等行为。应妥善保管 VIP 会员账号及密码，因用户自身原因导致账号或密码泄露而造成的任何损失，由用户自行承担责任。若发现账号存在异常使用情况，应立即通知我们。不得对小程序进行反向工程、反向编译、破解或试图获取小程序的源代码，不得干扰、破坏小程序的正常运行，不得利用小程序的漏洞或缺陷谋取不正当利益。
（二）公司权利与义务
1. 权利：有权按照本协议约定向用户收取会员费用。有权根据法律法规、监管要求、运营需要等对小程序进行维护、升级、改造或调整服务内容，但应尽量减少对用户使用服务的影响，并在合理时间内提前通知用户。若用户违反本协议约定，我们有权暂停或终止向用户提供 VIP 会员服务，且不退还已收取的会员费用；若因用户的违约行为给我们造成损失的，我们有权要求用户予以赔偿。
2. 义务：按照本协议约定向 VIP 会员提供稳定、可靠的服务，确保服务质量，并尽力保障小程序的正常运行。因我们自身原因导致服务中断或出现故障时，应及时采取措施恢复服务，并向用户说明情况。对用户的个人信息严格保密，按照我们的隐私政策收集、使用和保护用户信息，不得泄露、出售或非法向第三方提供用户的个人信息，但法律法规另有规定或政府部门要求的除外。及时处理用户的咨询、投诉 and 反馈，为用户提供必要的技术支持和服务指导。

五、知识产权
1. 临研核心词汇小程序及其所有内容，包括但不限于文字、图片、图表、音频、视频、商标、标识、界面设计、版面框架以及软件程序等，均受到知识产权法律法规的保护，归我们或相关授权方所有。
2. 用户仅有权在本协议约定的范围内使用小程序及相关服务，未经我们书面许可，用户不得以任何形式复制、修改、传播、出售、转让、许可或创造衍生作品等侵犯小程序知识产权的行为。

六、免责声明
1. 尽管我们将尽力确保服务的稳定性和准确性，但由于互联网环境的复杂性以及可能存在的技术故障、网络问题、不可抗力等因素，我们无法保证小程序服务始终不间断、无错误或无病毒。对于因上述原因导致用户在使用服务过程中遭受的任何直接或间接损失，我们不承担责任，但因我们故意或重大过失造成的除外。
2. 本服务所提供的临研核心词汇相关信息仅供参考。
3. 对于第三方提供的链接、内容或服务，我们不承担任何责任。小程序可能包含指向其他网站或资源的链接，这些链接仅为方便用户而提供，我们对第三方网站或资源的内容、隐私政策、安全性等不进行控制，也不承担任何责任。用户在访问第三方链接时应自行承担风险。

七、协议变更与终止
1. 协议变更：我们有权根据法律法规的变化、业务发展需要等对本协议进行修改和更新。修改后的协议将在小程序内以适当方式公布，并在公布后的[10]个工作日后生效。请用户定期查看本协议，若用户在协议变更生效后继续使用 VIP 会员服务，即表示用户接受修改后的协议内容。若用户不同意修改后的协议，应立即停止使用服务，并按照本协议约定申请终止会员服务。
2. 协议终止：在会员有效期届满后，如用户未续费，本协议自动终止，用户将失去 VIP 会员资格。若用户违反本协议约定，我们有权单方面终止本协议，并停止向用户提供服务。在这种情况下，我们将不退还已收取的会员费用，且用户应承担因违约给我们造成的损失。 若因不可抗力、法律法规调整、政府部门要求或其他不可预见、不可避免的原因导致我们无法继续提供服务，本协议自动终止。我们将按照剩余未使用会员期限比例退还相应费用，但不承担其他额外责任。

八、争议解决
1. 本协议的签订、履行、解释及争议解决均适用[具体适用法律地区]法律。
2. 如双方在本协议履行过程中发生争议，应首先通过友好协商解决；协商不成的，任何一方均有权向有管辖权的人民法院提起诉讼。

九、其他条款
1. 本协议构成双方就本服务的完整协议，取代双方之前就本服务所达成的任何口头或书面协议。
2. 本协议中任何条款的无效或不可执行，不影响其他条款的有效性和可执行性。
3. 我们未行使或延迟行使本协议项下的任何权利，不构成对该权利的放弃。`
